//LINK     EXEC PGM=IEWL,PARM='LIST,XREF'
//SYSLMOD  DD   DSN=SYS2.LINKLIB,DISP=SHR
//OBJECT   DD   DSN=userid.PROG.OBJ,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSLIN   DD   *
 INCLUDE OBJECT(EZASOH03)
 INCLUDE OBJECT(EZACIC04)
 INCLUDE OBJECT(EZACIC05)
 ALIAS EZACIC04,EZACIC05
 NAME EZASOH03(R)